/**
 * Created by liko on 2017/6/12.
 */
import Mock from 'mockjs'
// 使用 Mock
export default Mock.mock({
  'combo|10': [
    {
      'goodsId|+1': 1,
      'goodsImg|+1': 1,
      'goodsName|+1': ['鱼蛋粉+花卷','鲜香肉酱蒸米粉+热豆浆（小）','蒸米粉+沙棘汁','小豆浆花卷','蒸饺+皮蛋粥','蒸饺+瘦肉粉','蒸饺+鱼蛋粉','肉酱米粉+豆浆','小瘦肉粉糯米鸡','皮蛋粥+糯米鸡'],
      'price|20-50': 1
    }
  ],
  'foods|10': [
    {
      'goodsId|+1': 11,
      'goodsImg|+1': 1,
      'goodsName|+1': ['新品-七道功夫烧肉丸','虫草花蒸土鸡饭','排骨拼鸡腿肉饭','鲜剁冬菇肉饼饭','香汁排骨饭','冬（香）菇鸡腿肉饭','酸菜卤肉饭','鲜辣排骨饭','榨菜牛肉饭','鱼香茄子饭'],
      'price|20-50': 1
    }
  ],
  'snacks|10': [
    {
      'goodsId|+1': 21,
      'goodsImg|+1': 1,
      'goodsName|+1': ['外婆菜','馋香蒸饺','西兰花','香辣焗翅','香滑蒸蛋','田园彩豆','黑椒Q肠','桂花糖油粑粑','荫荫哒小黄鸭','五彩面疙瘩汤'],
      'price|20-50': 1
    }
  ],
  'drinks|10': [
    {
      'goodsId|+1': 31,
      'goodsImg|+1': 1,
      'goodsName|+1': ['青柠冰桔茶','乌梅汁','可乐','玉米汁','橙汁（杯）','桃源酒酿米浆','酸角山莓汁','加多宝','椰奶','雪碧'],
      'price|20-50': 1
    }
  ]
});
